<?php

return [
	'button' => 'Подробнее',
	'on' => 'от',
	'updated' => ' последнее обновление ',
	'tags' => 'Теги ',
	'comments' => 'Комментарии',
	'comment' => 'Добавить комментарий?',
	'info-comment' => 'Вы должны авторизоваться, чтобы оставить комментарий!',
	'delete' => 'Удалить комментарий',
	'edit' => 'Обновить комментарий',
	'change' => 'Измените Ваш комментарий здесь:',
	'valid' => 'Верно',
	'undo' => 'Отмена',
	'fail-update' => 'Ошибка обновления. Нет данных или слишком длинный текст',
	'fail-delete' => 'Ошибка обновления.',
	'warning' => 'Спасибо за Ваш комментарий. Он появится после одобрения администратором (только для первого комментария)',
	'search' => 'Поиск в блоге',
	'info-tag' => 'Записи с тегами ',
	'info-search' => 'Найденные записи ',
	'confirm' => 'Действительно удалить этот комментарий?'
];