<?php

return [
	'connection' => 'Вход',
	'text' => 'Для входа заполните, пожалуйста, форму:',
	'email' => 'Ваш Email',
	'password' => 'Ваш пароль',
	'remind' => 'Запомнить меня',
	'forget' => 'Забыли пароль?',
	'register' => 'Ещё не зарегистрированы?',
	'register-info' => 'Для быстрой регистрации нажмите здесь!',
	'registering' => 'Регистрация',
	'credentials' => 'Эти учетные данные не соответствуют нашим данным.',
	'log' => 'Ваш Email или логин',
	'maxattempt' => 'Вы достигли максимального числа попыток входа в систему. Повторите попытку через одну минуту.'
];