<?php

return [
	'title' => 'Восстановление пароля',
	'info'  => 'Потеряли пароль? Укажите адрес Вашей электронной почты, заполнив эту форму. Вы получите сообщение с инструкцией по восстановлению пароля.',
	'email' => 'Ваш Email',
	'title-reset' => 'Придумайте пароль',
	'reset-info' => 'Для создания нового пароля, пожалуйста, заполните форму:',
	'password' => 'Ваш пароль',
	'confirm-password' => 'Подтвердите Ваш пароль',
	'warning' => 'Внимание',
	'warning-password' => 'Не менее 6 символов',
	'reset' => 'Напомнить пароль',
	'email-title' => 'Напомнить пароль',
	'email-intro'=> 'Сбросить Ваш пароль ',
	'email-link' => 'перейдите по этой ссылке',
	'email-expire' => 'Эта ссылка действует ',
	'minutes' => ' мин.'
];