<?php

return [
	'title' => 'Регистрация',
	'infos' => 'Для регистрации заполните, пожалуйста, форму',
	'email' => 'Email',
	'pseudo' => 'Логин',
	'password' => 'Пароль',
	'confirm-password' => 'Подтвердите Ваш пароль',
	'warning' => 'Внимание',
	'warning-name' => 'От 2 до 32 символов. Только латинские буквы, цифры и _-',
	'warning-password' => 'Допустимые символы: латинские буквы, цифры или знаки _~!@#$%^&*-. От 6 до 32 символов',
	'ok' => 'Вы зарегистрированы!',
	'error'=> 'Эти учетные данные не соответствуют нашим данным.'
];