<?php

return [
	'email-title' => 'Подтверждение Email',
	'email-intro'=> 'Подтвердите Ваш email: ',
	'email-link' => 'перейдите по этой ссылке',
	'message' => 'Спасибо за регистрацию! Пожалуйста, проверьте Ваш email.',
	'success-auth' => 'Вы подтвердили Ваш аккаунт! Теперь Вы можете войти.',
	'success' => 'Вы подтвердили Ваш аккаунт! Добро пожаловать.',
	'some-error' => 'Что-то пошло не так. Отправьте запрос на подтверждение снова',
	'error' => 'Код некорректен или устарел, попробуйте получить новое подтверждение по электронной почте, пожалуйста, <a href="' . url('auth/confirm') . '" class="alert-link">нажмите здесь</a>.',
	'get-text' => 'Чтобы получить подтверждение аккаунта по электронной почте для полного доступа к сайту, укажите Ваш email: ', 
	'again' => 'Вы должны подтвердить Ваш email, чтобы получить полный доступ к сайту.' .
                '<br>Если вы не получили подтверждение по электронной почте, проверьте папку СПАМ.'.
                '<br>Для того, чтобы получить новое подтверждение по электронной почте, пожалуйста, <a href="' . url('auth/confirm') . '" class="alert-link">нажмите здесь</a>.', 
    'resend' => 'Информация для подтверждения была отправлена. Пожалуйста, проверьте Ваш email.'
];

