<?php

return [
	'dashboard' => 'Управление записями',
	'creation' => 'Создано',
	'published' => 'Опубликовано',
	'title' => 'Заголовок',
	'permalink' => 'Ссылка :',
	'summary' => 'Резюме',
	'content' => 'Содержание',
	'tags' => 'Теги',
	'edition' => 'Публикация',
	'add' => 'Добавить запись',
	'posts' => 'Записи',
	'date' => 'Дата',
	'author' => 'Автор',
	'seen' => 'Просмотры',
	'yes' => 'Да',
	'no' => 'Нет',
	'see' => 'Смотреть',
	'edit' => 'Править',
	'destroy' => 'Удалить',
	'destroy-warning' => 'Действительно удалить запись?',
	'fail' => 'Ошибка обновления',
	'stored' => 'Запись сохранена',
	'updated' => 'Запись обновлена',
	'destroyed' => 'Запись удалена'
];