<?php

return [
	'dashboard' => 'Управление пользователями',
	'users' => 'пользователи',
	'add' => 'Добавить пользователя',
	'all' => 'Все',
	'name' => 'Имя',
	'role' => 'Роль',		
	'seen' => 'Просмотрен',
	'see' => 'Смотреть',
	'edit' => 'Править',
	'destroy' => 'Удалить',
	'destroy-warning' => 'Действительно удалить пользователя?',
	'fail' => 'Ошибка обновления',
	'creation' => 'Создание',
	'Users' => 'Пользователи',	
	'email' => 'Email',
	'password' => 'Пароль',
	'confirm-password' => 'Потвердите пароль',
	'edition' => 'Редактирование',
	'card' => 'Карточка',
	'created' => 'Пользователь создан.',
	'updated' => 'Пользователь обновлён.',
	'destroyed' => 'Пользователь удалён.',
	'confirmed' => 'Подтверждён',
	'not-confirmed' => 'Не подтверждён'
];