app/Http/Controllers/Learn/LearnController.php

    public function index(Order $order_m, Request $request, $link = '/')
    {
		if(!$link || $link === '/') return $this->indexHome();

		$links = explode('/',$link);
		$wid = array_pop($links);
		$path = implode('/',$links);
		$path = ($path) ? '/' . $path . '/' : '/';

		$table = $this->learn_m->getTable();


		$page = $this->learn_m
					->where($table.'.wid','=',$wid)
					->where($table.'.path','=',$path)
					->where($table.'.public','>',-1)
					->first();

		if($page)
		{

			$path_ids = explode('.',$page->path_ids);
			$crumbs = $this->learn_m
								->whereIn('id',$path_ids)
								->get();

			$childrens = $this->learn_m
								->where($table.'.path','LIKE',$path.$wid.'/')
								->where($table.'.title','NOT LIKE','')
								->where($table.'.public','>',0)
								->orderBy($table.'.updated_at', 'desc')
								->paginate(50);
---
select * from `learns` where `learns`.`wid` = 'mysli-globalno-dejstvuj-lokalno' and `learns`.`path` = '/webinar/' and `learns`.`public` > '-1' limit 1
select * from `learns` where `id` in ('1', '11')
select count(*) as aggregate from `learns` where `learns`.`path` LIKE '/webinar/mysli-globalno-dejstvuj-lokalno/' and `learns`.`title` NOT LIKE '' and `learns`.`public` > '0'

    public function indexHome()
    {
		$table = $this->learn_m->getTable();

		$page = $this->learn_m
					->where($table.'.wid','=','')
					->where($table.'.path','=','')
					->first();

		if($page)
		{
			$childrens = $this->learn_m
								->where($table.'.path','LIKE','/')
								->where($table.'.title','NOT LIKE','')
								->orderBy($table.'.created_at', 'desc')
								->paginate(20);
---
select * from `learns` where `learns`.`wid` = '' and `learns`.`path` = '' limit 1
select * from `learns` where `learns`.`path` LIKE '/' and `learns`.`title` NOT LIKE '' order by `learns`.`created_at` desc limit 20 offset 0
select count(*) as aggregate from `learns` where `learns`.`path` LIKE '/' and `learns`.`title` NOT LIKE ''