app/Http/Controllers/Iteam/HomeController.php

    public function indexHome()
    {

		$page = Articles::where('wid','=','')
					->where('path','=','')
					->first();
		if($page)
		{
			$childrens = [];
			if($page->children)
			{

				$childrens = Articles::with('parent')
								->where('path','LIKE','/publications/%')
								->where('title','NOT LIKE','')
								->where('children','=','0')
								->where('public','>','0')
								->where('published_at','<',date("Y-m-d H:i:s"))
								->orderBy('published_at', 'desc')
								->take($this->paginate)
								->get();
			}

			$crumbs = [];
			$user = Auth::user();

			$news = News::where('public','>','0')
								->orderBy('created_at', 'desc')
								->take(3)
								->get();

			$breakfast = Learn::where('path','=','/breakfast/')
								->where('public','>','0')
								->where('published_at','<',date("Y-m-d H:i:s"))
								->orderBy('published_at', 'desc')
								->first();

			$marks = Mark::all();
---
select * from `articles` where `wid` = '' and `path` = '' limit 1
select * from `articles` where `path` LIKE '/publications/%' and `title` NOT LIKE '' and `children` = '0' and `public` > '0' and `published_at` < '2018-02-02 09:57:34' order by `published_at` desc limit 10
select * from `news` where `public` > '0' order by `created_at` desc limit 3
select * from `learns` where `path` = '/breakfast/' and `public` > '0' and `published_at` < '2018-02-02 09:57:34' order by `published_at` desc limit 1
select * from `marks`

    public function indexABTest()
    {

		$page = Articles::where('wid','=','')
					->where('path','=','')
					->first();
		if($page)
		{
			$childrens = [];
			if($page->children)
			{

				$childrens = Articles::with('parent')
								->where('path','LIKE','/publications/%')
								->where('title','NOT LIKE','')
								->where('children','=','0')
								->where('public','>','0')
								->where('published_at','<',date("Y-m-d H:i:s"))
								->orderBy('published_at', 'desc')
								->take($this->paginate)
								->get();
			}

			$crumbs = [];
			$user = Auth::user();

			$news = News::where('public','>','0')
								->orderBy('created_at', 'desc')
								->take(3)
								->get();

			$breakfast = Learn::where('path','=','/breakfast/')
								->where('public','>','0')
								->where('published_at','<',date("Y-m-d H:i:s"))
								->orderBy('published_at', 'desc')
								->first();

			$marks = Mark::all();
---
select * from `articles` where `wid` = '' and `path` = '' limit 1
select * from `articles` where `path` LIKE '/publications/%' and `title` NOT LIKE '' and `children` = '0' and `public` > '0' and `published_at` < '2018-02-02 09:55:29' order by `published_at` desc limit 10
select * from `news` where `public` > '0' order by `created_at` desc limit 3
select * from `learns` where `path` = '/breakfast/' and `public` > '0' and `published_at` < '2018-02-02 09:55:29' order by `published_at` desc limit 1
select * from `marks`

    public function indexHomeV2()
    {

		$page = Articles::where('wid','=','')
					->where('path','=','')
					->first();
		if($page)
		{
			$childrens = [];
			if($page->children)
			{

				$childrens = Articles::with('parent')
								->where('path','LIKE','/publications/%')
								->where('title','NOT LIKE','')
								->where('children','=','0')
								->where('public','>','0')
								->where('published_at','<',date("Y-m-d H:i:s"))
								->orderBy('published_at', 'desc')
								->take($this->paginate)
								->get();
			}

			$crumbs = [];
			$user = Auth::user();

			$news = News::where('public','>','0')
								->orderBy('created_at', 'desc')
								->take(3)
								->get();

			$breakfast = Learn::where('path','=','/breakfast/')
								->where('public','>','0')
								->where('published_at','<',date("Y-m-d H:i:s"))
								->orderBy('published_at', 'desc')
								->first();

			$marks = Mark::all();
---
select * from `articles` where `wid` = '' and `path` = '' limit 1
select * from `articles` where `path` LIKE '/publications/%' and `title` NOT LIKE '' and `children` = '0' and `public` > '0' and `published_at` < '2018-02-02 10:27:32' order by `published_at` desc limit 10
select * from `news` where `public` > '0' order by `created_at` desc limit 3
select * from `learns` where `path` = '/breakfast/' and `public` > '0' and `published_at` < '2018-02-02 10:27:32' order by `published_at` desc limit 1
select * from `marks`