app/Http/Controllers/OrderController.php

    public function store(Request $request, Learn $learn_m)
    {

        $_redirect = $request->input('_redirect') ? $request->input('_redirect') : redirect()->back();

        $user = $this->user;
        $order = $this->order;

        $product_id = $request->input('product_id');
        $payment_type = $request->input('payment_type');

        $learn = $learn_m->find($product_id);

        if (!$learn) {
            return $_redirect->with('error', 'Продукт не найден');
        }

        if (!$user) {
            return redirect('/i/email')->with('error', 'Действие доступно после авторизации');
        }

        if (!$product_id) {
            return $_redirect->with('error', 'Не удалось определить ID продукта');
        }

        if (!$payment_type) {
            return $_redirect->with('error', 'Не удалось определить тип оплаты');
        }

        $old_order = $order
            ->where('user_id', '=', $user->id)
            ->where('product_id', '=', $product_id)
            ->first();
---
select * from `orders` where `user_id` = '7193' and `product_id` = '125' limit 1

    public function show(Request $request, $id)
    {
        $user = $this->user;
        $order = Order::with(['learn', 'user'])
            ->where('email', $user->email)
            ->findOrFail($id);
---
select * from `learns` where `learns`.`id` in ('27')
select * from `orders` where `email` = 'begimov@gmail.com' and `orders`.`id` = '2850' limit 1
select * from `users` where `users`.`id` in ('7193')